Revit 2025 API
FilterNumericRuleEvaluator.Evaluate Method
Overload List
Name | Description
Evaluate(Int32, Int32) | Obsolete.
 Derived classes should override this method to implement the desired test.
Evaluate(Int64, Int64) |  Derived classes should override this method to implement the desired test.
Evaluate(Double, Double, Double) |  Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.
Top
See Also
Reference
FilterNumericRuleEvaluator Class
Autodesk.Revit.DB Namespace